-- Doom dashboard config
local doom = function()
  local db = require 'dashboard'
  db.setup {
    theme = 'doom',
    config = {
      vertical_center = true,

      header = {
        [[                                                                                     ]],
        [[                                                                                     ]],
        [[                                                                                     ]],
        [[                                                                                     ]],
        [[  ▄████████ ▄██   ▄   ▀█████████▄     ▄████████      ▄█    █▄   ▄█    ▄▄▄▄███▄▄▄▄    ]],
        [[ ███    ███ ███   ██▄   ███    ███   ███    ███     ███    ███ ███  ▄██▀▀▀███▀▀▀██▄  ]],
        [[ ███    █▀  ███▄▄▄███   ███    ███   ███    ███     ███    ███ ███▌ ███   ███   ███  ]],
        [[ ███        ▀▀▀▀▀▀███  ▄███▄▄▄██▀   ▄███▄▄▄▄██▀     ███    ███ ███▌ ███   ███   ███  ]],
        [[ ███        ▄██   ███ ▀▀███▀▀▀██▄  ▀▀███▀▀▀▀▀       ███    ███ ███▌ ███   ███   ███  ]],
        [[ ███    █▄  ███   ███   ███    ██▄ ▀███████████     ███    ███ ███  ███   ███   ███  ]],
        [[ ███    ███ ███   ███   ███    ███   ███    ███     ███    ███ ███  ███   ███   ███  ]],
        [[ ████████▀   ▀█████▀  ▄█████████▀    ███    ███      ▀██████▀  █▀    ▀█   ███   █▀   ]],
        [[                                                                                     ]],
        [[                                                                                     ]],
        [[                                                                                     ]],
        [[                                                                                     ]],
      },

      center = {
        { icon = '+ ', desc = 'New File', key = 'n', action = 'enew' },
        { icon = ' ', desc = 'Find File', key = 'f', action = 'Telescope find_files' },
        { icon = ' ', desc = 'Recent Files', key = 'r', action = 'Telescope oldfiles' },
        { icon = ' ', desc = 'Find Word', key = 'g', action = 'Telescope live_grep' },
        { icon = ' ', desc = 'Quit', key = 'q', action = 'qa' },
      },

      footer = {
        '',
        'Keep on coding.',
        '',
      },
    },
  }

  vim.keymap.set('n', '<leader>d', '<cmd>Dashboard<CR>', { desc = '[D]ashboard' })

  -- Centre on resize
  vim.api.nvim_create_autocmd('VimResized', {
    callback = function() vim.cmd 'Dashboard' end,
  })
end

return {
  {
    'nvimdev/dashboard-nvim',
    event = 'VimEnter',
    dependencies = { 'nvim-tree/nvim-web-devicons' },
    config = function() doom() end,
  },
}
